# Level 20
# 1) დაწერე პროგრამა, რომელიც while ციკლით 3-ჯერ დაბეჭდავს სიტყვას „Hello“.
i = 0
while i != 3:
    print("hello")
    i+=1
# 2) დაწერე პროგრამა, რომელიც იწყებს 1-დან და while ციკლის გამოყენებით ბეჭდავს რიცხვებს 3-მდე.
x = 1
while x != 3:
    print(x)
    x+=1
# 3) დაწერე კოდი, რომელიც მომხმარებელს სთხოვს „კარგი?“ ჩაწეროს. სანამ პასუხი არ იქნება „კი“, პროგრამა კვლავ იკითხავს.
inp = input("კარგი")
while inp != "კი":
    inp = input("კარგი")

# 4) დაწერე პროგრამა, რომელიც იწყებს 1-დან და while ციკლით ყოველ ჯერზე ზრდის რიცხვს 1-ით, სანამ არ მიაღწევს 5-ს.
y = 1
while y != 5:
    print(y)
    y+=1
# 5) რისთვის გამოიყენება while loop?
# იმისთვის რომ შევასრულოთ რამე მოქმდედება მანამ სანმა პირობა არ შესურლდება
